<?php
namespace SlComponent\Util;

use SlComponent\Database\DBUtil;
use SlComponent\Database\SearchVo;

/**
 * Sitelab Code Key List
 * Class SlCode
 * @package SlComponent\Util
 */
class OekCodeMap {

    //완전 빠지는거.
    const LIMIT_EXCEPT_GOODS = [
        //OTIS 협력사
        1000000585,

        //TKE 판매
        1000000340, //23동계점퍼
        1000000341, //23동계바지
        1000000334, //23춘추점퍼

        1000000413,

        //OEK 하계 (수요조사)
        //1000000478,
        //1000000477,


        //기성복
        1000000495,
        1000000496,
        1000000497,
        1000000498,
        1000000499,

        //OEK 하계
        1000000374,
        1000000373,
        1000000410,
        1000000406,
        1000000405,

        //25하계
        1000000478,
        1000000477,
        //25동계
        1000000577,
        1000000576,

        //26춘추
        1000000601,
        1000000602,
        1000000603,
        1000000604,
        //26하계
        1000000617,
        1000000618,

        //OEK 춘추
        1000000381,
        1000000370,
        1000000369,
        1000000368,
        //25
        1000000461,
        1000000462,
        1000000463,
        1000000464,
        1000000477,
        1000000478,

        //OEK 동계
        1000000350, //바지
        1000000349, //점퍼

        //기성상품
        1000000428,
        1000000427,
        1000000426,
        1000000425,
        1000000406,
        1000000405,
        1000000430,
    ];

    //구매 제한 예외 TODO: 추후 DB설정
    const LIMIT_EXCEPTION_GOODS = [
        //OEK 상품
        1000000370,
        1000000369, //조끼
        1000000368,
        //FOD 상품
        1000000409,
        1000000416,
    ];
    const LIMIT_EXCEPTION_MEMBER = [
        //OEKs
        15591 => 4, //OEK 위세영(206062)
        15577 => 1, //OEK 강현식(211443)
        15567 => 1, //OEK 김남희(212367)
        15593 => 7, //OEK 김종현(209625)
        15596 => 34, //OEK 최재운(210069)
        15605 => 4, //OEK 최성현(205932)
        15553 => 4, //OEK 황선우(601348)
        //FOD
        16076 => 20, //FOD 조정희(T05936)
        16077 => 20, //FOD 조정희(T02970)
        16044 => 5, //FOD 정숙희(T05978)
        16090 => 5, //FOD T05746	오지용
        16089 => 4, //FOD T06090	김선애
        16083 => 3, //FOD T06278	나현봉
    ];
    const LIMIT_EXCEPTION_GOODS2 = [
        1000000369, //조끼
    ];
    const LIMIT_EXCEPTION_MEMBER2 = [
        15589 => 7, //OEK 김형석(211406)
    ];
    const LIMIT_EXCEPTION_GOODS3 = [
        1000000349=>[
            15589 => 1, //김형석
            15593 => 1, //김종현
        ],
        1000000350=>[
            15589 => 1,
            15593 => 1,
        ], //김형석
    ];


}


